Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/justice/courts_system/courts.html.txt.tmx
Source language: en
Languages: ga

source: There are four main courts in Ireland: the District Court, the Circuit Court, the High Court and the Supreme Court
ga: Tá ceithre phríomhchúirt in Éirinn: an Chúirt Dúiche, an Chúirt Chuarda, an Ard-Chúirt agus an Chúirt Uachtarach

source: Other courts in operation are the Special Criminal Court and the Court of Appeal
ga: Cúirteanna eile atá ag feidhmiú ná an Chúirt Choiriúil Speisialta agus an Chúirt Achomhairc

source: Articles 34 to 37 of Bunreacht na hEireann (the Irish Constitution) deal with the administration of justice in general and outline the structure of the court system
ga: Déileálann Airteagail 34 go 37 de Bhunreacht na hÉireann (Bunreacht na hÉireann) le riaradh an cheartais go ginearálta agus leagann siad amach struchtúr an chórais cúirte

source: Article 34.1 states that: "Justice shall be administered in courts established by law..." The present courts were set up by the Courts (Establishment and Constitution) Act 1961 (as amended)
ga: Sonraíonn Airteagal 34.1: "Déanfar ceartas a riaradh i gcúirteanna atá bunaithe de réir dlí..." Bhí na cúirteanna reatha bunaithe ag Acht na gCúirteanna (Bunú agus Comhdhéanamh), 1961(mar atá arna leasú)

source: The District Court has jurisdiction over minor civil and criminal matters
ga: Tá dlínse ag an gCúirt Dúiche i mionchásanna sibhialta agus coiriúla

source: You can appeal the outcome of a case heard in the District Court to the Circuit Court
ga: Is féidir achomharc a dhéanamh ar thoradh cáis a éisteadh sa Chúirt Dúiche chuig an Chúirt Chuarda

source: The Circuit Court has jurisdiction in more serious civil and criminal matters
ga: Tá dlínse ag an gCúirt Chuarda i gcásanna sibhialta agus coiriúla níos tromchúisí

source: You can appeal the outcome of a case heard in the Circuit Court to the High Court
ga: Is féidir achomharc a dhéanamh ar thoradh cáis a éisteadh sa Chúirt Chuarda chuig an Ard-Chúirt

source: The High Court is presided over by a President of the High Court
ga: Tá Uachtarán na hArd-Chúirte i gceannas san Ard-Chúirt

source: It also has jurisdiction over civil and criminal matters
ga: Tá dlínse aici i gcásanna sibhialta agus coiriúla chomh maith

source: For example, the most serious criminal offences, such as murder, are dealt with by the High Court
ga: Mar shampla, déileáiltear leis na cionta coiriúla is tromchúisí san Ard-Chúirt, cosúil le dúnmharú

source: The Court of Appeal hears appeals from cases heard in the Circuit Court and High Court
ga: Éisteann an Chúirt Achomhairc le hachomhairc ó chásanna a éisteadh sa Chúirt Chuarda agus san Ard-Chúirt

source: The Supreme Court was created as the final court of appeal and is presided over by the Chief Justice
ga: Cruthaíodh an Chúirt Uachtarach mar chúirt dheiridh achomhairc agus tá an Príomh-Bhreitheamh i gceannas uirthi

source: Though courts can have jurisdiction over both civil and criminal matters, the Special Criminal Court only deals with criminal cases
ga: Cé gur féidir le cúirteanna dlínse a bheith acu ar chásanna sibhialta agus coiriúla araon, déileálann an gCúirt Choiriúil Speisialta le cásanna coiriúla amháin

source: The Courts (Establishment and Constitution) Act 1961 also provides for the setting up of special courts where the best interest of justice would not be served in a normal court, for example, the Children's Court and the Drug Court
ga: Déanann Acht na gCúirteanna (Bunú agus Comhdhéanamh) 1961 foráil do bhunú na gcúirteanna speisialta nuair nach ndéanfaí freastal ar an leas ceartais is fearr sa chúirt choitianta, an Chúirt Leanaí agus an Chúirt Drugaí mar shampla

source: The courts are supported by the Offices of the Courts
ga: Tá tacaíocht ag na cúirteanna ó Oifigí na gCúirteanna

source: For example, the Office of the Ward of Court is responsible for the supervision of the affairs of people taken into the wardship of the High Court
ga: Mar shampla, tá Oifig an Choimircí Cúirte freagrach as maoirsiú ghnóthaí na ndaoine a tógadh faoi choimircíocht na hArd-Chúirte

source: The Courts Service was set up under the Court Service Act 1998 to manage the courts and court buildings, and to provide information about the operation of the courts
ga: Bunaíodh an tSeirbhís Chúirteanna faoin Acht um Sheirbhís Chúirteanna 1998 chun na cúirteanna agus foirgnimh na gcúirteanna a bhainistiú, agus chun faisnéis a sholáthar faoi oibriú na gcúirteanna
